talent-studio-integration/src/com/zynap/talentstudio/middleware/soap/taapi/sendit.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <AuthHeader soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next" soapenv:mustUnderstand="0">
            <Username>bronwen.cassidy@talentscope.com</Username>
            <Password>4321TS1234</Password>
        </AuthHeader>
    </soapenv:Header>
    <soapenv:Body>
        <ns1:findRespondents soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://api.talentanalytics.com/2012-01-01">
            <RespondentInfo href="#id0"/>
        </ns1:findRespondents>
        <multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:RespondentInfoType" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="https://api.talentanalytics.com/2012-01-01">
            <EMail xsi:type="xsd:string">gmail.com</EMail>
        </multiRef>
    </soapenv:Body>
</soapenv:Envelope>
